Hello, seems like fix for this issue introduced new one.  When I upgraded provider to v1.21.1 and run terraform plan it says that ibm_resource_key resource will be replaced, although no changes were made to this resource.
So the only change has been made
`terraform {
    required_version = ">= 0.13"
    required_providers {
        ibm = {
           source = "IBM-Cloud/ibm"
            version = "1.21.1"  # version chaged from 1.20.0 to 1.21.1
        }
    }
}`

And after this change I began to receive following out in terraform plan

`  # ibm_resource_key.svc-ftp-eu must be replaced
-/+ resource "ibm_resource_key" "svc-ftp-eu" {
      ~ credentials          = (sensitive value)
      ~ crn                  = "crn:v1:bluemix:public:cloud-object-storage:global:a/c8d5dfc2b7fcaf83ef524f51dc6740e7:dac561e0-57fa-476d-aafe-ffa917f2d588:resource-key:0f53a481-34a4-4d98-a719-c8d92b4f3f70" -> (known after apply)
      ~ id                   = "crn:v1:bluemix:public:cloud-object-storage:global:a/c8d5dfc2b7fcaf83ef524f51dc6740e7:dac561e0-57fa-476d-aafe-ffa917f2d588:resource-key:0f53a481-34a4-4d98-a719-c8d92b4f3f70" -> (known after apply)
        name                 = "svc-test"
      ~ parameters           = { # forces replacement
          + "HMAC" = "true"
        }
        resource_instance_id = "crn:v1:bluemix:public:cloud-object-storage:global:a/c8d5dfc2b7fcaf83ef524f51dc6740e7:dac561e0-57fa-476d-aafe-ffa917f2d588::"
        role                 = "Writer"
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "managed_by_terraform",
        ]
    }

Plan: 1 to add, 0 to change, 1 to destroy.`

And I assume it started behaving like this because of the change to parameters block https://github.com/kavya498/terraform-provider-ibm/blob/eb6338aecb6860ffcffecb81f8bdbfd90032dbf1/ibm/resource_ibm_resource_key.go#L65,  after removing from it `DiffSuppressFunc: applyOnce,`